In [7]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd


# Load in csv
university_data= ("Most-Recent-Cohorts-All-Data-Elements.csv")

university_df = pd.read_csv(university_data)
reduced_university_df =university_df[["UNITID","INSTNM","CONTROL","CITY","STABBR","ZIP","ACCREDAGENCY",
                                     "INSTURL","LATITUDE","LONGITUDE","MN_EARN_WNE_P6","MN_EARN_WNE_P8","MN_EARN_WNE_P10"]]
reduced_university_df = reduced_university_df.rename(
    columns={"UNITID":"University ID","INSTNM":"University Name","CONTROL": "Control of Institution", "CITY":"City","STABBR":"State","ZIP":"Zip",
                                     "INSTURL":"Website","LATITUDE":"Latitude","LONGITUDE":"Longitude",
             "MN_EARN_WNE_P6":"Mean Earnings 6","MN_EARN_WNE_P8": "Mean Earnings 8","MN_EARN_WNE_P10":"Mean Earnings 10"})


reduced_university_df.head(5)

C:\Users\finne\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3057: DtypeWarning: Columns (31,1608,1619,1620,1621,1622,1623,1624,1625,1626,1627,1628,1629,1640,1643,1648,1657,1666,1669,1674,1683,1688,1689,1690,1691,1692,1697,1700,1703,1704,1705,1706,1707,1726,1727,1728,1729,1815,1817,1823,1830,1879,1880,1881,1882,1883,1884,1885,1886,1887,1888,1889,1890,1891,1892,1893,1894,1895,1896,1897,1898,1957,1958,1959,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,1970,1971,1972,1973,1974,1975,1976) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,University ID,University Name,Control of Institution,City,State,Zip,ACCREDAGENCY,Website,Latitude,Longitude,Mean Earnings 6,Mean Earnings 8,Mean Earnings 10
0,100654,Alabama A & M University,1,Normal,AL,35762,Southern Association of Colleges and Schools C...,www.aamu.edu/,34.783368,-86.568502,28400,30600,35500
1,100663,University of Alabama at Birmingham,1,Birmingham,AL,35294-0110,Southern Association of Colleges and Schools C...,www.uab.edu,33.505697,-86.799345,39400,44100,48400
2,100690,Amridge University,2,Montgomery,AL,36117-3553,Southern Association of Colleges and Schools C...,www.amridgeuniversity.edu,32.362609,-86.174010,35400,40800,47600
3,100706,University of Alabama in Huntsville,1,Huntsville,AL,35899,Southern Association of Colleges and Schools C...,www.uah.edu,34.724557,-86.640449,40300,45900,52000
4,100724,Alabama State University,1,Montgomery,AL,36104-0271,Southern Association of Colleges and Schools C...,www.alasu.edu,32.364317,-86.295677,24400,27500,30600

In [9]:
reduced_university_df = reduced_university_df.replace({1: "Public", 2: "Private Nonprofit", 3: "Private For-Profit"})
reduced_university_df.head()

,University ID,University Name,Control of Institution,City,State,Zip,ACCREDAGENCY,Website,Latitude,Longitude,Mean Earnings 6,Mean Earnings 8,Mean Earnings 10
0,100654,Alabama A & M University,Public,Normal,AL,35762,Southern Association of Colleges and Schools C...,www.aamu.edu/,34.783368,-86.568502,28400,30600,35500
1,100663,University of Alabama at Birmingham,Public,Birmingham,AL,35294-0110,Southern Association of Colleges and Schools C...,www.uab.edu,33.505697,-86.799345,39400,44100,48400
2,100690,Amridge University,Private Nonprofit,Montgomery,AL,36117-3553,Southern Association of Colleges and Schools C...,www.amridgeuniversity.edu,32.362609,-86.174010,35400,40800,47600
3,100706,University of Alabama in Huntsville,Public,Huntsville,AL,35899,Southern Association of Colleges and Schools C...,www.uah.edu,34.724557,-86.640449,40300,45900,52000
4,100724,Alabama State University,Public,Montgomery,AL,36104-0271,Southern Association of Colleges and Schools C...,www.alasu.edu,32.364317,-86.295677,24400,27500,30600

In [14]:
public_earnings_6 = reduced_university_df[["University ID", "University Name", "Control of Institution", "Mean Earnings 6"]]

public_earnings_6 = public_earnings_6.set_index("Mean Earnings 6")

public_earnings_6.head()

,University ID,University Name,Control of Institution
Mean Earnings 6,,,
28400,100654,Alabama A & M University,Public
39400,100663,University of Alabama at Birmingham,Public
35400,100690,Amridge University,Private Nonprofit
40300,100706,University of Alabama in Huntsville,Public
24400,100724,Alabama State University,Public

In [15]:
public_earnings_6 = public_earnings_6.drop("PrivacySuppressed", axis=0)

public_earnings_6.head()

,University ID,University Name,Control of Institution
Mean Earnings 6,,,
28400,100654,Alabama A & M University,Public
39400,100663,University of Alabama at Birmingham,Public
35400,100690,Amridge University,Private Nonprofit
40300,100706,University of Alabama in Huntsville,Public
24400,100724,Alabama State University,Public

In [16]:
public_earnings_6 = public_earnings_6.reset_index()

public_earnings_6.head()

,Mean Earnings 6,University ID,University Name,Control of Institution
0,28400,100654,Alabama A & M University,Public
1,39400,100663,University of Alabama at Birmingham,Public
2,35400,100690,Amridge University,Private Nonprofit
3,40300,100706,University of Alabama in Huntsville,Public
4,24400,100724,Alabama State University,Public

In [24]:
public_earnings_6.sort_values('Mean Earnings 6', ascending=False).head()

,Mean Earnings 6,University ID,University Name,Control of Institution
1475,99600,166683,Massachusetts Institute of Technology,Private Nonprofit
2559,97200,204477,Northeast Ohio Medical University,Public
413,97200,122296,Samuel Merritt University,Private Nonprofit
910,96300,145628,Illinois College of Optometry,Private Nonprofit
2047,94500,188526,Albany College of Pharmacy and Health Sciences,Private Nonprofit

In [23]:
public_earnings_6.loc[public_earnings_6["University Name"] == "Philadelphia College of Osteopathic Medicine"]

,Mean Earnings 6,University ID,University Name,Control of Institution
2903,151500,215123,Philadelphia College of Osteopathic Medicine,Private Nonprofit

In [28]:
public_earnings_6.dropna(how='any',inplace=True)

In [29]:
public_earnings_6.count()

Mean Earnings 6           5358
University ID             5358
University Name           5358
Control of Institution    5358
dtype: int64

In [34]:
public_earnings_6.loc[public_earnings_6["University Name"] == "A T Still University of Health Sciences"]

,Mean Earnings 6,University ID,University Name,Control of Institution
1781,123700,177834,A T Still University of Health Sciences,Private Nonprofit